Revit 2027 API
LoadClassificationType Enumeration
An enumerated type listing all the possible load classification types for a connector object.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum LoadClassificationType
Public Enumeration LoadClassificationType
public enum class LoadClassificationType
type LoadClassificationType
Members
Member name | Value | Description
HVAC | 3 | Load Classification Type is HVAC.
Lighting | 2 | Load Classification Type is Lighting.
Other | 0 | Load Classification Type is Other.
Power | 1 | Load Classification Type is Power.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace